/*
 * @Author: xinkong2000
 * @Date:   2019-07-10 15:31:33
 * @Last Modified by:   xinkong2000
 * @Last Modified time: 2019-07-11 11:46:52
 */
export default {

	/*
	|------------------------------------------------------------
	| 获取数据例表的接口地址
	|------------------------------------------------------------
	| 图片空间会以prefix为前辍字段名在url中传参给接口地址，已获取该前辍下的数
	| 据
	| 例：http://www.xdw.test/api/all?prefix=images/
	|------------------------------------------------------------
	| 返回数据必须是JSON格式：
	| {
	|	"name" : "",		// [string][文件夹名称][必须]
	|	"prefix" : "",		// [string][对象辍名][必须]
	|	"objectList" : {
	|		"name" : "",	// [string][文件名][必须]
	|		"url" : "",		// [string][访问地址][必须]
	|		"key" : ""		// [string][对象的唯一识别码][必须]
	|		...				// [其它项]
	|	},
	|	"prefixList" : {
	|		"name" : ""		// [string][前辍名][必须]
	|		"prefix" : "" 	// [string][前辍][必须]
	|	},
	|	"percentage" : ""	// [integer][空间占用百分比]
	| }
	|------------------------------------------------------------
	| GET方法，获取数据；
	| PUT方法，上传文件和新建文件夹；
	| DELETE方法，删除对象
	*/
    apiUrl: 'http://www.xdw.test/api/all',

    /*
	|------------------------------------------------------------
	| 前辍字段名
	|------------------------------------------------------------
	| 图片空间会以此值为前辍字段名在url中传参给接口地址，已获取该前辍下的数据
	| 例：prefixName = 'prefix'
	| 获取数据的访问路径为：http://www.xdw.test/api/all?prefix=
	|------------------------------------------------------------
	| 返回数据必须是JSON格式：
	| {
	|	"name" : "",		// [string][文件夹名称][必须]
	|	"prefix" : "",		// [string][对象辍名][必须]
	|	"objectList" : {
	|		"name" : "",	// [string][文件名][必须]
	|		"url" : "",		// [string][访问地址][必须]
	|		"key" : ""		// [string][对象的唯一识别码][必须]
	|		...				// [其它项]
	|	},
	|	"prefixList" : {
	|		"name" : ""		// [string][前辍名][必须]
	|		"prefix" : "" 	// [string][前辍][必须]
	|	},
	|	"percentage" : ""	// [integer][空间占用百分比]
	| }
	|------------------------------------------------------------
	| GET方法，获取数据；
	| PUT方法，上传文件和新建文件夹；
	| DELETE方法，删除对象
	*/
    prefixName: 'prefix',

    /*
	|------------------------------------------------------------
	| 数据请求时头部信息
	|------------------------------------------------------------
	| 
	|
	*/
    headers: {}
};